CurrencyConverterService/internal/soap/testdata/soap-unknown-operation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cur="http://example.com/currencyconverter">
  <soapenv:Body>
    <cur:UnknownOperationRequest/>
  </soapenv:Body>
</soapenv:Envelope>
